[
  {
    "id": "forum-17586",
    "source": "stacks-forum",
    "status": "Proposal",
    "title": "Adding A Burn Function To Sip 010 Fungible Token Standard",
    "slug": "adding-a-burn-function-to-sip-010-fungible-token-standard",
    "topic_id": "17586",
    "url": "https://forum.stacks.org/t/adding-a-burn-function-to-sip-010-fungible-token-standard/17586",
    "created": "2025-02-04T18:55:06Z",
    "author": "Eriq",
    "html": "<div class=\"cooked\"><p>Hello Stacks Community,</p>\n<p>I would like to propose an enhancement to the SIP-010 fungible token standard by including a native burn function. While Clarity provides the <code>ft-burn?</code> function, this is not currently required in the SIP-010 trait. As a result, developers often rely on sending tokens to the zero address, which doesn’t truly reduce the circulating supply but just locks the tokens.</p>\n<p>Here’s why adding a burn function would be beneficial:</p>\n<ol>\n<li>Supply Control<br/>\nBurning tokens would provide a clear, permanent reduction in supply, helping control inflation and improve market stability.</li>\n<li>Encouraging Deflationary Models<br/>\nA standard burn function would simplify the creation of deflationary tokens, making them more attractive to long-term holders by naturally increasing scarcity.</li>\n<li>Transparency and Trust<br/>\nOn-chain burn events would be verifiable and final, ensuring transparency in token supply management and increasing trust within token economies.</li>\n</ol>\n<p>In conclusion, adding this feature would simplify development, encourage healthier tokenomics, and provide transparency in managing token supply. I look forward to hearing your thoughts on this proposal.</p>\n<p>Cheers</p>\n<p>Eriq</p></div>"
  },
  {
    "id": "forum-17899",
    "source": "stacks-forum",
    "status": "Proposal",
    "title": "Remove Cool Down Cycle In Stacking",
    "slug": "remove-cool-down-cycle-in-stacking",
    "topic_id": "17899",
    "url": "https://forum.stacks.org/t/remove-cool-down-cycle-in-stacking/17899",
    "created": null,
    "author": "unknown",
    "html": "<div class=\"cooked\"><p>Currently, users have to wait for 1 cycle without rewards when they want to change the pool, decrease the stacking amount or change the PoX reward address. Therefore, it is expensive to do any of these actions. For large stackers or pools, this can cost tens of thousands of dollars. When we don’t have a cool down cycle anymore, there would be also more competition between pools.</p>\n<p>We can remove the cool down cycle by the following changes:</p>\n<ul>\n<li>fix the pox anchor block in the last 10 blocks, currently, 100 block. The prepare phase would be reduced to 10 blocks.</li>\n<li>unlock tokens at the beginning of the current prepare phase (100 last block), currently at block 0 of the next cycle.</li>\n</ul>\n<p>That gives users 90 blocks to change any of their stacking settings.</p>\n<p>This also has the following impact:</p>\n<ul>\n<li>New stackers can join stacking until 10 blocks (currently 100 blocks) before the next cycle.</li>\n<li>Burn phase is reduced from 100 to 10 blocks. That would increase the number of rewards slots to 4180 slots and reduce the slot price (minimum stacked stx for 1 slot).</li>\n</ul>\n<p>The key change is to unlock stx earlier than currently. We did that for the hard forks already when changing pox contracts: unlocked at the beginning and continued to receive rewards the whole cycle.</p>\n<p>I have the feeling that the proposed changes are manageable short term. However, I might be wrong, and it is much harder to implement than I think.</p>\n<p>This proposal requires a hard fork.</p>\n<p>This proposal is in addition to the simplified stacking proposal in <a class=\"inline-onebox\" href=\"https://forum.stacks.org/t/stacks-roadmap-and-product-vision-update/17852/13\">Stacks Roadmap and Product Vision Update - #13 by friedger</a></p></div>"
  },
  {
    "id": "forum-18116",
    "source": "stacks-forum",
    "status": "Proposal",
    "title": "Sip 031 Treasury Model For The Sovereign Individual Empowering Choice In The Stacks Ecosystem",
    "slug": "sip-031-treasury-model-for-the-sovereign-individual-empowering-choice-in-the-stacks-ecosystem",
    "topic_id": "18116",
    "url": "https://forum.stacks.org/t/sip-031-treasury-model-for-the-sovereign-individual-empowering-choice-in-the-stacks-ecosystem/18116",
    "created": "2025-06-04T23:04:56Z",
    "author": "unknown",
    "html": "<div class=\"cooked\"><p>In the realm of decentralized finance, where the word “governance” too often hides the specter of collectivism, a new paradigm emerges: one that enshrines the sovereignty of the individual. The proposed treasury model for the Stacks ecosystem is not merely a technical refinement; it is a moral revolution. It breaks with the democratic fetishism that plagues most DAOs and aligns instead with the unyielding logic of individual freedom.</p>\n<h3>\n<a class=\"anchor\" href=\"#the-essence-of-the-proposal-1\" name=\"the-essence-of-the-proposal-1\"></a>The Essence of the Proposal</h3>\n<p>At the center of this model is a profound recognition: that value belongs to the one who creates it, and capital should only be directed by those who own it. Under this model, annual STX emissions, akin to a treasury or public funding mechanism, are not centrally administered or allocated by majority vote. Instead, they are distributed proportionally to STX holders, each of whom retains full authority to:</p>\n<ul>\n<li>\n<strong>Allocate</strong> their share to categories they value (e.g., development, marketing, grants),</li>\n<li>\n<strong>Split</strong> their allocation across multiple targets as they see fit,</li>\n<li>Or <strong>burn</strong> their share entirely to prevent dilution and remove capital from potential misuse.</li>\n</ul>\n<h3>\n<a class=\"anchor\" href=\"#a-system-based-on-allocation-not-voting-2\" name=\"a-system-based-on-allocation-not-voting-2\"></a>A System Based on Allocation, Not Voting</h3>\n<p>It is crucial to draw a sharp line between <strong>individual allocation</strong> and <strong>collective voting</strong>.</p>\n<p>In voting-based models, participants are bound by majority rule. The individual’s will is subordinate to the mob. But this treasury system is not a vote. It is not a consensus. It is a mechanism of personal judgment. You are not asked to convince others to share your values, you are asked only to act on them with the share you own.</p>\n<blockquote>\n<p>“The smallest minority on earth is the individual. Those who deny individual rights cannot claim to be defenders of minorities.”</p>\n</blockquote>\n<p>There is no permission required. No negotiation. No dependence on groupthink. You choose. You fund. Or you withdraw. Entirely.</p>\n<h3>\n<a class=\"anchor\" href=\"#advantages-of-the-individual-centric-model-3\" name=\"advantages-of-the-individual-centric-model-3\"></a>Advantages of the Individual-Centric Model</h3>\n<ul>\n<li>\n<strong>Empowerment Through Choice</strong>: You are not a subject of a treasury; you are its sovereign allocator. Your share is yours to direct, undiluted by consensus or bureaucracy.</li>\n<li>\n<strong>Safeguard Against Misallocation</strong>: The ability to burn your share is a weapon against inefficiency. It disciplines the ecosystem by denying capital to mediocrity.</li>\n<li>\n<strong>Market-Aligned Incentives</strong>: Like a rational investor in a free market, you fund what you judge valuable. You withhold support from what you judge wasteful.</li>\n<li>\n<strong>No Tyranny of the Majority</strong>: Unlike DAO votes where the many override the few, here the many act individually. Each person’s decision is final over their capital.</li>\n<li>\n<strong>Enhanced Transparency and Accountability</strong>: Projects must earn allocation from multiple rational actors, not win popularity contests. This cultivates merit, not manipulation.</li>\n</ul>\n<h3>\n<a class=\"anchor\" href=\"#parallel-with-real-world-governance-4\" name=\"parallel-with-real-world-governance-4\"></a>Parallel with Real-World Governance</h3>\n<p>In traditional states, taxation is coercive. Your wealth is taken, then spent without your consent. This model redefines that paradigm. Emissions, like tax revenue, are created, yes, but their destiny is determined voluntarily by each participant. It is taxation but much less coercion. Public funding without expropriation. A system that honors consent.</p>\n<p>This is not just more efficient. It is more moral.</p>\n<hr/>\n<pre><code class=\"lang-auto\">`                    +------------------------+\n                    |   Annual STX Emission |\n                    |  (e.g., SIP-031 pool) |\n                    +----------+--------------+\n                               |\n                               v\n             +----------------+-----------------------+\n             |                                   |\n             |   STX Holder Proportional Share   |\n             |      (based on % ownership)      |\n             +----------------+------------------------+\n                               |\n          +-------------------+-------------------------------+\n          |                                             |\n          v                                            v\n+-------------------------+                                    +----------------------------+\n|  Choose Funding Targets |              |     Burn My Allocation     |\n|-------------------------|                                      /-------------------------------|\n|  % to Development       |              |  Burn STX share directly   |\n|  % to Marketing         |              |  -&gt; Reduces supply         |\n|  % to Community Grants  |              |  -&gt; Prevents dilution      |\n|  (etc., any categories) |              +--------------------------------+\n+-----------+-------------+\n            |\n            v\n+----------------------------------------------------------+\n| Funds Distributed to Targets                    |\n|  via Smart Contracts                            |\n|  (based on individual choices not a majority vote|\n+---------------------------------------------------------+\n`\n</code></pre>\n<p>This is not a mechanism of governance. It is a marketplace of vision. A battlefield of ideas where each person’s capital follows their judgment.</p>\n<hr/>\n<h3>\n<a class=\"anchor\" href=\"#conclusion-the-moral-and-practical-superiority-of-this-model-5\" name=\"conclusion-the-moral-and-practical-superiority-of-this-model-5\"></a>Conclusion: The Moral and Practical Superiority of This Model</h3>\n<p>This treasury model is not just a better way to fund the growth of the Stacks ecosystem, it is the only way compatible with the ethics of decentralization. It aligns incentive with judgment. It punishes passivity and rewards clarity of purpose. It respects each participant as a sovereign being, not a gear in a collective machine.</p>\n<p>Let us embrace this model not as a technical upgrade, but as a moral imperative. For it is only through the supremacy of the individual that any system, financial or political, can be truly just, truly free, and truly great.</p></div>"
  },
  {
    "id": "forum-18130",
    "source": "stacks-forum",
    "status": "Proposal",
    "title": "Sip 31 1 A New Draft Arrives",
    "slug": "sip-31-1-a-new-draft-arrives",
    "topic_id": "18130",
    "url": "https://forum.stacks.org/t/sip-31-1-a-new-draft-arrives/18130",
    "created": "2025-06-21T01:44:30Z",
    "author": "Alex",
    "html": "<div class=\"cooked\"><p>As promised, below is my proposal for the revision of SIP-31.</p>\n<p>This draft was made based on the conversations with the community for the last week and written in conjunction with <a class=\"mention\" href=\"/u/codeonedotzero\">@codeonedotzero</a> and <a class=\"mention\" href=\"/u/cuevasm\">@cuevasm</a>. A huge thank you to everyone who participated in these conversations (here and in spaces and elsewhere) over the last week - this update would not have been possible without the deep and thoughtful engagements we had and is exactly what we hoped for this process to produce.</p>\n<p>The full draft is available in <strong><a href=\"https://docs.google.com/document/d/1u8CM14p_tbNO4vh1Ih5ZDl57ZYJnIHTvUTKS0_rorFc/\">this Google Doc</a></strong> - please make that the primary place for comments on the draft to make collaborating easier as move forward.</p>\n<p>Additionally, I’ve talked to the Foundation team who have said they will propose a process and next steps for choosing Appointments Committee members by the end of the week, so keep an eye out for that.</p>\n<p>The rest of this post contains a summary of the major changes and the thinking behind them.</p>\n<p><strong>(1) Clarified the intent of the SIP as benefitting ALL builders</strong><br/>\n<strong>(2) Added a “Community Grants” program</strong><br/>\n<strong>(3) Added a section on burning tokens if the Endowment grows sufficiently</strong><br/>\n<strong>(4) Added a “Potential Risks” section</strong><br/>\n<strong>(5) Added more detail around reporting expectations from the endowment</strong><br/>\n<strong>(6) Clarified limitations on the Endowment</strong></p>\n<h3>\n<a class=\"anchor\" href=\"#clarified-the-intent-of-the-sip-as-benefitting-all-builders-1\" name=\"clarified-the-intent-of-the-sip-as-benefitting-all-builders-1\"></a>Clarified the intent of the SIP as benefitting ALL builders</h3>\n<p>There was feedback from a number of community members that they felt the SIP was overly focused on DeFi at the expense of other projects - based on these conversations I added the clear strategic vision of the Stacks ecosystem as being the home of the entire Bitcoin economy and looked for changes throughout to clearly reflect the community-wide impact of the SIP.</p>\n<h3>\n<a class=\"anchor\" href=\"#added-a-community-grants-program-2\" name=\"added-a-community-grants-program-2\"></a>Added a “Community Grants” program</h3>\n<p>While the entire SIP is meant to benefit the entire community, there was a concern that community members working on something that may fall outside the highest current/ immediate ecosystem priorities would be left out. While a clear strategy is good, we are building a global, comprehensive ecosystem and there should still be a path for projects that widely benefit the community. This can help ensure that various areas of the ecosystem have a way to request resources, even during times when more widely impactful or critical work (like Nakamoto and sBTC were) is the clear priority.</p>\n<p>As such, I’m proposing a “Community Grants” program to address this. Anyone can request a grant and the requests, much like DeGrants and the Stacks Foundation grants before that, would all be public. Community members can ‘upvote’ / comment on the ones they think are valuable, similar has been done via GitHub on Grants and Critical Bounties historically, with the final allocations decided by the Treasury Committee. This is to ensure there’s no gaming of the system, to establish a legal relationship with the Grantee such that they can be paid, and gives the committee leverage to hold Grantees accountable if needed.</p>\n<p>Because the community input is all public, it will be obvious if the committee is routinely not funding things that the community as a whole thinks is valuable, feasible, and impactful and action can be taken to address (hearings, SIP, etc.).</p>\n<p>There was the suggestion that this should be just a set budget that the “community” gets to allocate but I think that gets problematic very quickly (who is ‘the community’, what’s the accountability process around it, etc). These are issues previous experiences and grant programs have solved for over the years with a structure very similar to what I’m proposing above. Using the Treasury Committee means all the accountability processes we’re already building can get re-used for it and the committee is made up of nominated community leaders anyway.</p>\n<p>Finally, the reference to the Operational Entity administering it is just to indicate that they need to do the work to ensure there is a process/platform for these grants to happen, they don’t make the calls on what gets funded.</p>\n<h3>\n<a class=\"anchor\" href=\"#added-a-section-on-burning-tokens-if-the-endowment-grows-sufficiently-3\" name=\"added-a-section-on-burning-tokens-if-the-endowment-grows-sufficiently-3\"></a>Added a section on burning tokens if the Endowment grows sufficiently</h3>\n<p>Another concern brought up was the amount of tokens being raised - in order to avoid having to consider another set of emissions later, the rate of emissions in this SIP were chosen based on the third party economic analysis and to ensure that the Endowment raised sufficient funds even in a scenario where the token price does not considerably rise.</p>\n<p>Conversely, it is possible that if STX materially overperforms the model in the economic report in the short to mid-term (for instance if it rose to $10+ /token), then the Endowment will likely be sufficiently equipped without needing all of the planned emissions and a token burn can be set up to burn the later part of the emissions.</p>\n<p>Therefore, I’ve added a section that if the Endowment exceeds $1B USD in liquid value across all its assets, then it must create a token burn plan to burn the future/excess tokens and present this to the community to be voted upon. This was chosen because $1B, well invested, should easily provide $50m+ USD per year for ongoing operations.</p>\n<p>I chose not to create a specific burn plan now but rather require the development at the time for several reasons, in particular: (1) we don’t know what the economic situation of crypto/the world will be at the time that it exceeds $1B and that would affect what the most responsible plan is. (2) The community should have the option to decide at that time if they want to burn the tokens or if there is a better use for them.</p>\n<h3>\n<a class=\"anchor\" href=\"#added-a-potential-risks-section-4\" name=\"added-a-potential-risks-section-4\"></a>Added a “Potential Risks” section</h3>\n<p>As noted by several people, it is prudent to include a section on the potential risks of this SIP, I added those based on suggestions from the community and key contributors…</p>\n<h3>\n<a class=\"anchor\" href=\"#added-more-detail-around-reporting-expectations-from-the-endowment-5\" name=\"added-more-detail-around-reporting-expectations-from-the-endowment-5\"></a>Added more detail around reporting expectations from the endowment</h3>\n<p>While there were commitments made in the SIP around reporting, there is not enough context as to why those are chosen or what some of the larger communication should be. In order to balance both operational efficiency with clarity for the community I added specific detail as to the reporting standards and made clear that all funds should flow through on-chain addresses to be traceable by the community.</p>\n<h3>\n<a class=\"anchor\" href=\"#clarified-limitations-on-the-endowment-6\" name=\"clarified-limitations-on-the-endowment-6\"></a>Clarified limitations on the Endowment</h3>\n<p>The SIP already contained a restriction on the Endowment not voting with its tokens on SIPs, but I increased the clarity in order to ensure it remains neutral and to remove any potential effect it would have on the governance process.</p>\n<hr/>\n<p>Thank you again to everyone who made this possible and I look forward to discussing your thoughts on this!</p>\n<p>Alex</p></div>"
  },
  {
    "id": "forum-18137",
    "source": "stacks-forum",
    "status": "Proposal",
    "title": "Sip Proposal Trust Lines On Stacks",
    "slug": "sip-proposal-trust-lines-on-stacks",
    "topic_id": "18137",
    "url": "https://forum.stacks.org/t/sip-proposal-trust-lines-on-stacks/18137",
    "created": "2025-06-07T15:27:16Z",
    "author": "Trust Lines On Stacks",
    "html": "<div class=\"cooked\"><h1>\n<a class=\"anchor\" href=\"#trust-lines-on-stacks-1\" name=\"trust-lines-on-stacks-1\"></a>TRUST LINES ON STACKS</h1>\n<p>Trust Lines on Stacks prevents hacks by preventing unauthorized transfers to accounts not on your wallet white list.</p>\n<h2>\n<a class=\"anchor\" href=\"#background-2\" name=\"background-2\"></a>BACKGROUND</h2>\n<p>SIP-013 - Semi-fungible Tokens - was inspired by EIP-1155. What this tells us is that there are paradigms, features attributes and benefits that are useful from other chains to expand use cases with Stacks. Think of how Rome conquered Carthage by learning ship-building.</p>\n<p>Why am I telling you this? Well, XRP, which is one of the key competitors for DEFI overall, leverages Trust Lines to empower the ENTIRE DEFI LANDSCAPE on XRP. You can see the spec here: <a class=\"inline-onebox\" href=\"https://xrpl.org/docs/concepts/tokens/fungible-tokens/authorized-trust-lines\" rel=\"noopener nofollow ugc\">Authorized Trust Lines</a></p>\n<h2>\n<a class=\"anchor\" href=\"#problem-worth-solving-job-to-be-done-3\" name=\"problem-worth-solving-job-to-be-done-3\"></a>PROBLEM WORTH SOLVING / JOB-TO-BE-DONE</h2>\n<p>If there is a single barrier to onboarding new capital into Stacks, it’s hacks.</p>\n<p>And that’s why we created this SIP: Trust Lines on Stacks.</p>\n<p>The market on XRP has decided that Trust Lines are a core part of running a resilient DEFI Ecosystem. It stands to reason that the same market that enjoys XRP will like to configure their DEFI experience using the same paradigms they enjoy on XRP.</p>\n<p>So…Trust Lines on Stacks. It’s the way we open the floodgates to value flowing into Stacks.</p>\n<h2>\n<a class=\"anchor\" href=\"#demo-4\" name=\"demo-4\"></a>Demo</h2>\n<p><a class=\"onebox\" href=\"https://resilient-bombolone-da0704.netlify.app/\" rel=\"noopener nofollow ugc\" target=\"_blank\">https://resilient-bombolone-da0704.netlify.app/</a></p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://harmonious-tour-434674.framer.app/\">\n<header class=\"source\">\n<img class=\"site-icon\" height=\"500\" src=\"https://framerusercontent.com/images/MHYVUQMUli0aF9OBUEOgWhPIBfU.jpeg\" width=\"500\"/>\n<a href=\"https://harmonious-tour-434674.framer.app/\" rel=\"noopener nofollow ugc\" target=\"_blank\">harmonious-tour-434674.framer.app</a>\n</header>\n<article class=\"onebox-body\">\n<h3><a href=\"https://harmonious-tour-434674.framer.app/\" rel=\"noopener nofollow ugc\" target=\"_blank\">Trust Lines On Stacks | XRP Spec</a></h3>\n<p>Trust Lines On Stacks</p>\n</article>\n<div class=\"onebox-metadata\">\n</div>\n<div style=\"clear: both\"></div>\n</aside>\n<h2>\n<a class=\"anchor\" href=\"#tldr-5\" name=\"tldr-5\"></a>TL;DR</h2>\n<p>TRUST LINES ENSURE THAT ONLY PEOPLE YOU TRUST CAN TRANSACT WITH YOU BY ENABLING WALLETS TO WHITELIST TRUSTED ACCOUNTS.</p>\n<h3>\n<a class=\"anchor\" href=\"#demo-links-6\" name=\"demo-links-6\"></a>Demo Links:</h3>\n<p><a class=\"onebox\" href=\"https://x.com/attractfund1ng/status/1883074256801800200\" rel=\"noopener nofollow ugc\" target=\"_blank\">https://x.com/attractfund1ng/status/1883074256801800200</a><br/>\n<a class=\"onebox\" href=\"https://x.com/attractfund1ng/status/1885198910915743914\" rel=\"noopener nofollow ugc\" target=\"_blank\">https://x.com/attractfund1ng/status/1885198910915743914</a><br/>\n<a class=\"onebox\" href=\"https://x.com/attractfund1ng/status/1884914063035060377\" rel=\"noopener nofollow ugc\" target=\"_blank\">https://x.com/attractfund1ng/status/1884914063035060377</a></p>\n<h2>\n<a class=\"anchor\" href=\"#get-to-the-technical-point-already-7\" name=\"get-to-the-technical-point-already-7\"></a>GET TO THE TECHNICAL POINT ALREADY</h2>\n<p>This SIP outlines a new Clarity library and corresponding functions for implementing Trust Lines on the Stacks blockchain. The Trust Lines mechanism would operate as a layer on top of existing token standards and would not require any consensus-breaking changes to the Stacks blockchain.</p>\n<p>The proposed Trust Lines system will include the following features:</p>\n<ul>\n<li>\n<strong>Trust Line Establishment</strong>: Users can establish a Trust Line for a specific token with another user by specifying the token, the counterparty, and the credit limit.</li>\n<li>\n<strong>Token Transfers via Trust Lines</strong>: Transfers of tokens between accounts with established Trust Lines can occur without requiring immediate on-chain settlements. The system will maintain a balance ledger for each Trust Line, tracking credits and debits.</li>\n<li>\n<strong>Trust Line Modification</strong>: Users can modify the credit limit of an existing Trust Line, either increasing or decreasing it.</li>\n<li>\n<strong>Trust Line Closure</strong>: Users can close a Trust Line, settling any outstanding balances using on-chain token transfers.</li>\n</ul>\n<p>The Clarity library will provide the following functions:</p>\n<ul>\n<li>\n<strong>establish-trust-line</strong>: Creates a new Trust Line between two accounts.</li>\n<li>\n<strong>transfer-via-trust-line</strong>: Executes a token transfer through an existing Trust Line.</li>\n<li>\n<strong>modify-trust-line</strong>: Changes the credit limit of a Trust Line.</li>\n<li>\n<strong>close-trust-line</strong>: Settles outstanding balances and closes a Trust Line.</li>\n</ul>\n<h2>\n<a class=\"anchor\" href=\"#features-attributes-and-benefits-for-stacks-by-introducing-trust-lines-8\" name=\"features-attributes-and-benefits-for-stacks-by-introducing-trust-lines-8\"></a>FEATURES ATTRIBUTES AND BENEFITS FOR STACKS BY INTRODUCING TRUST LINES</h2>\n<ul>\n<li>Increased Flexibility: Trust Lines provide a more granular and customizable approach to managing token relationships between users.</li>\n</ul>\n<h2>\n<a class=\"anchor\" href=\"#github-9\" name=\"github-9\"></a>GitHub</h2>\n<aside class=\"onebox githubblob\" data-onebox-src=\"https://github.com/unicornlaunching/SyndiTheCommunityCoPilotforStacks/blob/main/SIP_trust_lines_xrp.md\">\n<header class=\"source\">\n<a href=\"https://github.com/unicornlaunching/SyndiTheCommunityCoPilotforStacks/blob/main/SIP_trust_lines_xrp.md\" rel=\"noopener nofollow ugc\" target=\"_blank\">github.com</a>\n</header>\n<article class=\"onebox-body\">\n<h4><a href=\"https://github.com/unicornlaunching/SyndiTheCommunityCoPilotforStacks/blob/main/SIP_trust_lines_xrp.md\" rel=\"noopener nofollow ugc\" target=\"_blank\">unicornlaunching/SyndiTheCommunityCoPilotforStacks/blob/main/SIP_trust_lines_xrp.md</a></h4>\n<pre><code class=\"lang-md\"># KEEP SHIT OUTCHA WALLET\n## TRUST LINES ENSURE THAT ONLY PEOPLE YOU TRUST CAN TRANSACT WITH YOU\n\n# TRUST LINES ON STACKS | XRP IMPLEMENTATION\n\n###### SIP TYPE: Non-Consensus Breaking Change\n\n## EXECUTIVE SUMMARY\n\nThis SIP proposes the introduction of Trust Lines to the Stacks blockchain as a non-consensus breaking mechanism to facilitate flexible and trust-based token management within the Stacks ecosystem.\n\n## GET TO THE TECHNICAL POINT ALREADY\n\nThis SIP outlines a new Clarity library and corresponding functions for implementing Trust Lines on the Stacks blockchain. The Trust Lines mechanism would operate as a layer on top of existing token standards and would not require any consensus-breaking changes to the Stacks blockchain.\n\nThe proposed Trust Lines system will include the following features:\n- **Trust Line Establishment**: Users can establish a Trust Line for a specific token with another user by specifying the token, the counterparty, and the credit limit.\n- **Token Transfers via Trust Lines**: Transfers of tokens between accounts with established Trust Lines can occur without requiring immediate on-chain settlements. The system will maintain a balance ledger for each Trust Line, tracking credits and debits.\n- **Trust Line Modification**: Users can modify the credit limit of an existing Trust Line, either increasing or decreasing it.\n- **Trust Line Closure**: Users can close a Trust Line, settling any outstanding balances using on-chain token transfers.\n</code></pre>\n\n\n\n  This file has been truncated. <a href=\"https://github.com/unicornlaunching/SyndiTheCommunityCoPilotforStacks/blob/main/SIP_trust_lines_xrp.md\" rel=\"noopener nofollow ugc\" target=\"_blank\">show original</a>\n</article>\n<div class=\"onebox-metadata\">\n</div>\n<div style=\"clear: both\"></div>\n</aside>\n</div>"
  }
]
